### Note

To be able to connect jupyter to the database, the following packages needed to be installed.
Run the following code in a cell:

!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

In [ ]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

# Overview of the data

We can start by looking at the first 5 rows of data to get a better understanding of what we are working with.

In [24]:
%%sql
SELECT *
    FROM facts
    Limit 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Here are the descriptions for some of the columns:

name - The name of the country.
area - The total land and sea area of the country.
population - The country's population.
population_growth- The country's population growth as a percentage.
birth_rate - The country's birth rate, or the number of births a year per 1,000 people.
death_rate - The country's death rate, or the number of death a year per 1,000 people.
area- The country's total area (both land and water).
area_land - The country's land area in square kilometers.
area_water - The country's waterarea in square kilometers.

We can begin with some summary statistics and see what we get.

In [11]:
%%sql
SELECT MIN(population),
        MAX(population),
        MIN(population_growth),
        MAX(population_growth)      
FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

We can see that there is a country with a population of 0 and a country with a population of 7.2 billion.
Let's take a look into that further.

In [13]:
%%sql
SELECT *
FROM facts
WHERE population == (SELECT MIN(population)
                    FROM facts)

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

It seems that the table contains a row for Antartica, this explains the population of 0.

In [14]:
%%sql
SELECT *
FROM facts
WHERE population == (SELECT MAX(population)
                    FROM facts)

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

We can also see that the table contains a row for the world, which explains the maximum population value that we got earlier.
Now that we know this, we should recalculate the summary statistics we calculated earlier, excluding the row for the whole world.

In [16]:
%%sql
SELECT MIN(population) AS min_pop,
        MAX(population) AS max_pop,
        MIN(population_growth) AS min_growth,
        MAX(population_growth) AS max_growth     
FROM facts
WHERE name <> 'World'                # <> means Not equal to

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

We can now see that the maximum population for a country is 1.4 billion!

In [17]:
%%sql
SELECT AVG(population),
        AVG(area)
    FROM facts
    WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

The average population of a country after we exclude the world row is around 32.24 million.
And the average area that a country encompases is 555 thousand square kilometers.

# More exploratory questions

We can further analyze the database to get some interesting data.
Such as, Which countries have more water than land?

In [26]:
%%sql
SELECT *
    FROM facts
    WHERE area_water > area_land
    AND name <> 'World';

 * sqlite:///factbook.db
Done.

[(228, 'io', 'British Indian Ocean Territory', 54400, 60, 54340, None, None, None, None, None),
 (247, 'vq', 'Virgin Islands', 1910, 346, 1564, 103574, 0.59, 10.31, 8.54, 7.67)]

We can also write a query to come up with the most densely populated countries.
We will identify this with countries that have a above average population and a low average for area.

In [31]:
%%sql
SELECT *
    FROM facts
    WHERE population > (SELECT AVG(population)
                           FROM facts
                           WHERE name <> 'World')
    AND area < (SELECT AVG(area)
                           FROM facts
                           WHERE name <> 'World'
               );

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]